W4D3/cats99-2/app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "end_date", "start_date", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 7], ["end_date", "2016-12-10"], ["start_date", "2016-12-08"], ["status", "PENDING"], ["created_at", "2016-12-08 00:46:17.259378"], ["updated_at", "2016-12-08 00:46:17.259378"]]
---
  def create
    @rental_request = CatRentalRequest.new(cat_rental_request_params)
    @rental_request.user_id = current_user.id
    if @rental_request.save