W4D3/cats99-2/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)
    @cat.owner = current_user
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "description", "name", "sex", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @cat = Cat.find(params[:id])
    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT 1  [["id", 7]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "brown"], ["description", ""], ["updated_at", "2016-12-08 01:16:57.321670"], ["id", 9]]