W4D3/cats99-2/app/views/cats/_req_tr.html.erb

SELECT  1 AS one FROM "cats" WHERE "cats"."user_id" = $1 AND "cats"."id" = $2 LIMIT 1  [["user_id", 3], ["id", 2]]
SELECT "cats".* FROM "cats" WHERE "cats"."user_id" = $1  [["user_id", 3]]
---
  <td>
    <% if current_user && eq.pending? && current_user.cats.exists?(cat) %>